package top.orange233.litereader.bean;

public class ChapterResultBean {
    /**
     * ok : true
     * chapter : {"title":"正文 第一章 七怪","body":"\n\r\n\r\n\r请安装最新版追书 以便使用优质资源","isVip":false,"order":1,"currency":10,"id":"5b978d4673a61f0e1a0f9df3","created":"2018-09-11T09:39:18.415Z","updated":"2018-09-11T09:39:18.415Z","cpContent":"    一个普通清晨，一位蓝色长发几乎落地的男子正在自己屋前仿佛是多年的习惯一般盯着初生的太阳，眼中还泛着淡淡的蓝光。但是忽然一声甘甜的女声打破了这一宁静。\u201c三哥早啊，小舞在吗。我想和她一起去摘些水果让小奥做些水果沙拉吃。\u201d\n这声音的来源便是蓝发男子多年的伙伴。九彩仙女宁荣荣。她口中的小奥便是这食神奥斯卡。说到这里，大家也知道这人是谁。便是当今神界最强者，神界执法官，海神修罗神双神位一体的唐三。小舞，便是唐三的妻子，和唐三共享神位的人。在神史上，也是仅有的。\n\u201c荣荣啊，小舞睡懒觉呢。你进去吧，正好叫她起来吃早饭。我现在去给你们做\u201d。唐三极度温柔的说出这些话。他的表情和气质完全不像是拥有这么强大力量的人，反而像是一个很平凡的好丈夫。宁荣荣毫不客气的扔给唐三一个饭盒,偷偷笑着说：\u201c三哥，论实力我们比不过你，可是这做饭的手艺啊，你可比不上我们家小奥。这是他早上给我做的早饭，知道我要过来找你们两个，就让我带过来点。\u201d\n唐三一脸无奈，这话说的其实不错，要说做饭的实力，谁比得过食神啊。就算是一个马上馊掉的馒头，让他摸摸都是这世间少有的美事。\u201c好吧，那你快去叫醒小舞吧，我去拿碗筷。\u201d宁荣荣得到允许后，蹦跳着跑到小舞的房间。看到粉红色的床上躺着一位极美的女孩儿，满脸的桃红色，明明是一位已经活了近千年了女人，还是长得想一位刚刚二十岁美丽的女子。不知道这面容，惹得多少人羡慕。\n宁荣荣蹑手蹑脚的来到小舞的耳边，小声的说道：\u201c小舞~起床了。太阳晒屁股了！\u201d可是床上的小舞揉揉惺忪的睡眼，没有一点想要睡醒的样子。宁荣荣一脸坏笑，把手伸进小舞的衣服里。\u201c小舞快起床了！！！\u201d小舞被忽然大声叫喊的宁荣荣吓醒。看到她的手在自己的衣服里面，一阵脸红还着急的让荣荣把手拿出去。\n\u201c咳咳，你们俩别闹了，快起床吃饭了。等会儿老大他们要来。荣荣你们就先不要去摘水果了，他们过来好像是有事情要说\u201d唐三在门口看着屋里大闹的二女一脸无奈。小舞飞快的从床上跳起来，整个人挂在唐三身上。\u201c早上好啊哥\u201d说着还给了唐三深深一吻。宁荣荣变成了尴尬的一方。\n三人一起吃过了饭，在唐三刚把碗筷放下的时候。一股熟悉的热气扑面来而。\u201c三哥，我们来了。好啊，吃好吃的不等我你们还是不是兄弟啊。\u201d这火急火燎进来的便是这凤凰之神马红俊。\u201c死胖子，你还知道吃啊。你看看院子里。就你最后一个到的，饭啊，早没了。\u201d宁荣荣没好气的白了马红俊一眼。\n马红俊往院子里一看，可不是嘛，当初的史莱克七怪，自己是最后一个来的。马红俊没好气的说道\u201c戴老大，没你们这样的，故意让兄弟出丑的。来这么快\u201d忽然一把菜刀朝自己飞来，已他的实力，轻轻松松便躲开了。\u201c死胖子，别那么大声，哥哥做雕刻呢，弄坏了你赔啊。\u201d这扔来菜刀的便是食神奥斯卡。马红俊口中的戴老大，是当年称霸斗罗大陆的史莱克七怪之首，力量之神戴沐白。他身边还站着一位浑身黑色装束的女子，她就是戴沐白的妻子，速度之神朱竹清。\n七人一同站在院子里拌嘴，虽说在拌嘴，但是处处也体现出了他们的兄弟之情。\n\u201c好了不要闹了，快说吧，为什么今天都来了。不会就是因为太闲了来找我玩把。\u201d唐三站出来组织了局面。\n\u201c我们也不知道，精神之海里有声音让今天来找你，小三你没有收到嘛。\u201d戴沐白站出来说。唐三查看自己的精神之海\u201c没有啊，我最近没有收到任何信息啊。\u201d唐三话音未落，天空便出现了一阵异响，从云中飞下一男一女。对于在神界已经生活了这么多年的唐三等人，并不觉得七怪。那是神界两大神王，黑暗之神与光明之神。\n神王在神界的地位高于一切，虽说唐三的实力并不在他们之下，可是身份毕竟是身份。七人同时单膝下跪。\u201c海神唐三所属等七位神邸，参见神王大人\u201d\n\u201c七位快起，本王这次来是有事情要请七位帮忙，请各位一定要本王啊。\u201d黑暗之神急躁的呼唤唐三等人起身。\u201c神王大人，你们都解决不了的事情，找我们有什么用啊。\u201d站起来的马红俊第一个喊道，因为他觉得这世上最强的神王都没有办法解决的事情，他们能解决的几率也是微呼极微。\n\u201c因为这事情发生在斗罗大陆。几位成神之前都是来自那个世界，所以这件事情必须各位去做。\u201d光明之神淡淡的解释着。黑暗之神连忙接着说\u201c是啊，这件事情关乎着神界的存亡，我们曾经都不是魂师，所以希望各位去完成，完成之后，我们两位。。。\u201d在黑暗之神还没有说完，就被一个声音打断\u201c够了！我们不同意！斗罗大陆！我永远不想回去。\u201d这声音，正是来自凤凰之神马红俊。他的脸上充满了怒气，眼中也充满了眼泪。\n\u201c胖子，你。。\u201d戴沐白看着他，虽然他们都明白为什么马红俊那么讨厌重返斗罗大陆。但是这么顶撞神王毕竟是不好的。黑暗之神明显怒了\u201c凤凰之神马红俊，你知道顶撞神王是什么后果嘛，如此大逆不道。是不想再要这你当初拼命得到的神位了吗。\u201d马红俊当然不是因为不想做神，而是心里对神界对斗罗大陆有种莫名的怨言。这一切还要从他们还没来到神界开始说起。\n"}
     */

    private boolean ok;
    private ChapterBean chapter;

    public boolean isOk() {
        return ok;
    }

    public void setOk(boolean ok) {
        this.ok = ok;
    }

    public ChapterBean getChapter() {
        return chapter;
    }

    public void setChapter(ChapterBean chapter) {
        this.chapter = chapter;
    }

    public static class ChapterBean {
        /**
         * title : 正文 第一章 七怪
         * body :


         请安装最新版追书 以便使用优质资源
         * isVip : false
         * order : 1
         * currency : 10
         * id : 5b978d4673a61f0e1a0f9df3
         * created : 2018-09-11T09:39:18.415Z
         * updated : 2018-09-11T09:39:18.415Z
         * cpContent :     一个普通清晨，一位蓝色长发几乎落地的男子正在自己屋前仿佛是多年的习惯一般盯着初生的太阳，眼中还泛着淡淡的蓝光。但是忽然一声甘甜的女声打破了这一宁静。“三哥早啊，小舞在吗。我想和她一起去摘些水果让小奥做些水果沙拉吃。”
         这声音的来源便是蓝发男子多年的伙伴。九彩仙女宁荣荣。她口中的小奥便是这食神奥斯卡。说到这里，大家也知道这人是谁。便是当今神界最强者，神界执法官，海神修罗神双神位一体的唐三。小舞，便是唐三的妻子，和唐三共享神位的人。在神史上，也是仅有的。
         “荣荣啊，小舞睡懒觉呢。你进去吧，正好叫她起来吃早饭。我现在去给你们做”。唐三极度温柔的说出这些话。他的表情和气质完全不像是拥有这么强大力量的人，反而像是一个很平凡的好丈夫。宁荣荣毫不客气的扔给唐三一个饭盒,偷偷笑着说：“三哥，论实力我们比不过你，可是这做饭的手艺啊，你可比不上我们家小奥。这是他早上给我做的早饭，知道我要过来找你们两个，就让我带过来点。”
         唐三一脸无奈，这话说的其实不错，要说做饭的实力，谁比得过食神啊。就算是一个马上馊掉的馒头，让他摸摸都是这世间少有的美事。“好吧，那你快去叫醒小舞吧，我去拿碗筷。”宁荣荣得到允许后，蹦跳着跑到小舞的房间。看到粉红色的床上躺着一位极美的女孩儿，满脸的桃红色，明明是一位已经活了近千年了女人，还是长得想一位刚刚二十岁美丽的女子。不知道这面容，惹得多少人羡慕。
         宁荣荣蹑手蹑脚的来到小舞的耳边，小声的说道：“小舞~起床了。太阳晒屁股了！”可是床上的小舞揉揉惺忪的睡眼，没有一点想要睡醒的样子。宁荣荣一脸坏笑，把手伸进小舞的衣服里。“小舞快起床了！！！”小舞被忽然大声叫喊的宁荣荣吓醒。看到她的手在自己的衣服里面，一阵脸红还着急的让荣荣把手拿出去。
         “咳咳，你们俩别闹了，快起床吃饭了。等会儿老大他们要来。荣荣你们就先不要去摘水果了，他们过来好像是有事情要说”唐三在门口看着屋里大闹的二女一脸无奈。小舞飞快的从床上跳起来，整个人挂在唐三身上。“早上好啊哥”说着还给了唐三深深一吻。宁荣荣变成了尴尬的一方。
         三人一起吃过了饭，在唐三刚把碗筷放下的时候。一股熟悉的热气扑面来而。“三哥，我们来了。好啊，吃好吃的不等我你们还是不是兄弟啊。”这火急火燎进来的便是这凤凰之神马红俊。“死胖子，你还知道吃啊。你看看院子里。就你最后一个到的，饭啊，早没了。”宁荣荣没好气的白了马红俊一眼。
         马红俊往院子里一看，可不是嘛，当初的史莱克七怪，自己是最后一个来的。马红俊没好气的说道“戴老大，没你们这样的，故意让兄弟出丑的。来这么快”忽然一把菜刀朝自己飞来，已他的实力，轻轻松松便躲开了。“死胖子，别那么大声，哥哥做雕刻呢，弄坏了你赔啊。”这扔来菜刀的便是食神奥斯卡。马红俊口中的戴老大，是当年称霸斗罗大陆的史莱克七怪之首，力量之神戴沐白。他身边还站着一位浑身黑色装束的女子，她就是戴沐白的妻子，速度之神朱竹清。
         七人一同站在院子里拌嘴，虽说在拌嘴，但是处处也体现出了他们的兄弟之情。
         “好了不要闹了，快说吧，为什么今天都来了。不会就是因为太闲了来找我玩把。”唐三站出来组织了局面。
         “我们也不知道，精神之海里有声音让今天来找你，小三你没有收到嘛。”戴沐白站出来说。唐三查看自己的精神之海“没有啊，我最近没有收到任何信息啊。”唐三话音未落，天空便出现了一阵异响，从云中飞下一男一女。对于在神界已经生活了这么多年的唐三等人，并不觉得七怪。那是神界两大神王，黑暗之神与光明之神。
         神王在神界的地位高于一切，虽说唐三的实力并不在他们之下，可是身份毕竟是身份。七人同时单膝下跪。“海神唐三所属等七位神邸，参见神王大人”
         “七位快起，本王这次来是有事情要请七位帮忙，请各位一定要本王啊。”黑暗之神急躁的呼唤唐三等人起身。“神王大人，你们都解决不了的事情，找我们有什么用啊。”站起来的马红俊第一个喊道，因为他觉得这世上最强的神王都没有办法解决的事情，他们能解决的几率也是微呼极微。
         “因为这事情发生在斗罗大陆。几位成神之前都是来自那个世界，所以这件事情必须各位去做。”光明之神淡淡的解释着。黑暗之神连忙接着说“是啊，这件事情关乎着神界的存亡，我们曾经都不是魂师，所以希望各位去完成，完成之后，我们两位。。。”在黑暗之神还没有说完，就被一个声音打断“够了！我们不同意！斗罗大陆！我永远不想回去。”这声音，正是来自凤凰之神马红俊。他的脸上充满了怒气，眼中也充满了眼泪。
         “胖子，你。。”戴沐白看着他，虽然他们都明白为什么马红俊那么讨厌重返斗罗大陆。但是这么顶撞神王毕竟是不好的。黑暗之神明显怒了“凤凰之神马红俊，你知道顶撞神王是什么后果嘛，如此大逆不道。是不想再要这你当初拼命得到的神位了吗。”马红俊当然不是因为不想做神，而是心里对神界对斗罗大陆有种莫名的怨言。这一切还要从他们还没来到神界开始说起。

         */

        private String title;
        private String body;
        private boolean isVip;
        private int order;
        private int currency;
        private String id;
        private String created;
        private String updated;
        private String cpContent;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getBody() {
            return body;
        }

        public void setBody(String body) {
            this.body = body;
        }

        public boolean isIsVip() {
            return isVip;
        }

        public void setIsVip(boolean isVip) {
            this.isVip = isVip;
        }

        public int getOrder() {
            return order;
        }

        public void setOrder(int order) {
            this.order = order;
        }

        public int getCurrency() {
            return currency;
        }

        public void setCurrency(int currency) {
            this.currency = currency;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getCreated() {
            return created;
        }

        public void setCreated(String created) {
            this.created = created;
        }

        public String getUpdated() {
            return updated;
        }

        public void setUpdated(String updated) {
            this.updated = updated;
        }

        public String getCpContent() {
            return cpContent;
        }

        public void setCpContent(String cpContent) {
            this.cpContent = cpContent;
        }
    }
}
